## Задание 4.3.7
Используя полученные знания и способы работы с данными, напишите программу, которая переставляет буквы вашего имени в обратном порядке.

## Решение
```cs
using System;

namespace test
{
    class Program
    {
        static void Main(string[] args)
        {
            string name = Console.ReadLine();
            string nameRevers="";

            foreach (char c in name)
                nameRevers = c + nameRevers;

            Console.WriteLine(nameRevers);
        }
    }
}
```
